Тест_ЗУП_31_КОРП/src/Enums/РолиФизическихЛиц/РолиФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиФизическихЛиц</name>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>БывшийСотрудник</name>
  </enumValues>
  <enumValues>
    <name>Акционер</name>
  </enumValues>
  <enumValues>
    <name>ПрочийПолучательДоходов</name>
  </enumValues>
  <enumValues>
    <name>РаздатчикЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>Кандидат</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/РолиФизическихЛиц/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	КадровыйУчетРасширенныйВызовСервера.ОбработкаПолученияДанныхВыбораПеречисленияРолиФизическихЛиц(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДействующиеРолиФизическихЛиц() Экспорт
	
	РолиФизическихЛиц = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации") Тогда
		РолиФизическихЛиц.Добавить(Перечисления.РолиФизическихЛиц.Акционер);
	КонецЕсли;
	РолиФизическихЛиц.Добавить(Перечисления.РолиФизическихЛиц.БывшийСотрудник);
	РолиФизическихЛиц.Добавить(Перечисления.РолиФизическихЛиц.ПрочийПолучательДоходов);
	РолиФизическихЛиц.Добавить(Перечисления.РолиФизическихЛиц.РаздатчикЗарплаты);
	РолиФизическихЛиц.Добавить(Перечисления.РолиФизическихЛиц.Сотрудник);
	
	Возврат РолиФизическихЛиц;
	
КонецФункции

#КонецОбласти

#КонецЕсли
